src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/УчетЗатрат/УчетЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетЗатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/МатериалыЗаказчиков/МатериалыЗаказчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МатериалыЗаказчиков</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалКлиента</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/Documents/Реализация/ObjectModule.bsl
// Модуль объекта документа "Реализация".
// Содержит:
//   1. Обработчик заполнения "на основании" документа "ЗаказНаряд" (сгенерирован конструктором).
//   2. Основную логику проведения с контролем остатков, партионным списанием
//      (FEFO – по сроку годности), формированием движений по нескольким регистрам
//      и бухгалтерскими проводками.

#Область ОбработчикиСобытий

// Данный фрагмент автоматически построен конструктором ввода на основании.
// Заполняет реквизиты и табличные части нового документа "Реализация"
// на основе данных выбранного документа-основания "ЗаказНаряд".
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    //{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
        // Явно получаем объект-основание, чтобы избежать неявных загрузок из базы.
        ОбъектОснование = ДанныеЗаполнения.ПолучитьОбъект();
        Если ОбъектОснование = Неопределено Тогда
            Возврат;
        КонецЕсли;
        
        // Заполнение шапки из документа-основания.
        ДокументОснование = ДанныеЗаполнения;   // ссылка на основание
        
        НомерЗаказа = ОбъектОснование.Номер;
        ДатаЗаказа = Формат(ОбъектОснование.Дата, "ДЛФ=DD.MM.YYYY");
        Автомобиль = ОбъектОснование.Автомобиль;
        Контрагент = ОбъектОснование.Клиент;
        Комментарий = "Введен на основании: Заказ-наряд №" + НомерЗаказа + " от " + ДатаЗаказа;
        Сотрудник = ОбъектОснование.Сотрудник;
        СуммаДокумента = ОбъектОснование.СуммаДокумента;
        
        // Перенос материалов заказчика.
        Для Каждого ТекСтрокаМатериалыЗаказчика Из ОбъектОснование.МатериалыЗаказчика Цикл
            НоваяСтрока = МатериалыЗаказчика.Добавить();
            НоваяСтрока.Количество = ТекСтрокаМатериалыЗаказчика.Количество;
            НоваяСтрока.Номенклатура = ТекСтрокаМатериалыЗаказчика.Номенклатура;
            НоваяСтрока.СостояниеМатериала = ТекСтрокаМатериалыЗаказчика.СостояниеМатериала;
        КонецЦикла;
        
        // Перенос услуг.
        Для Каждого ТекСтрокаУслуги Из ОбъектОснование.Услуги Цикл
            НоваяСтрока = Услуги.Добавить();
            НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
            НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
            НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
            НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
        КонецЦикла;
    КонецЕсли;
    //}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    // 1. Подготовка – указываем, что движения будут записываться.
    Движения.ТоварыНаСкладах.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;
    Движения.УчетЗатрат.Записывать = Истина;
    Движения.ЗаказыКлиентов.Записывать = Истина;
    Движения.МатериалыЗаказчиков.Записывать = Истина;
    Движения.Хозрасчетный.Записывать    = Истина;
    
    Движения.ТоварыНаСкладах.Записать();
    Движения.МатериалыЗаказчиков.Записать();
    
    // 2. Блокировка данных регистра остатков для обеспечения корректного списания.
    Блокировка = Новый БлокировкаДанных;
    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    ЭлементБлокировки.ИсточникДанных = Товары;
    ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
    ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
    Блокировка.Заблокировать();
    
    // 3. Основной запрос: объединяем товары и услуги в одну временную таблицу,
    //    получаем остатки с группировкой по партиям (срок годности) с сортировкой
    //    для реализации метода FEFO (списание сначала с истекающим сроком годности).
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    РеализацияТовары.Номенклатура КАК Номенклатура,
    |    СУММА(РеализацияТовары.Количество) КАК Количество,
    |    СУММА(РеализацияТовары.Сумма) КАК Сумма,
    |    &Склад КАК Склад
    |ПОМЕСТИТЬ ВТ_Товары
    |ИЗ
    |    Документ.Реализация.Товары КАК РеализацияТовары
    |ГДЕ
    |    РеализацияТовары.Ссылка = &Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |    РеализацияТовары.Номенклатура
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    РеализацияУслуги.Услуга,
    |    СУММА(РеализацияУслуги.Количество),
    |    СУММА(РеализацияУслуги.Сумма),
    |    NULL
    |ИЗ
    |    Документ.Реализация.Услуги КАК РеализацияУслуги
    |ГДЕ
    |    РеализацияУслуги.Ссылка = &Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |    РеализацияУслуги.Услуга
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    ВТ_Товары.Номенклатура КАК Номенклатура,
    |    ВТ_Товары.Количество КАК КоличествоВДокументе,
    |    ВТ_Товары.Сумма КАК СуммаВДокументе,
    |    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
    |    ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
    |    ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
    |    ВТ_Товары.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
    |    ВТ_Товары.Номенклатура.Представление КАК НоменклатураПредставление,
    |    ВЫБОР
    |        КОГДА ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
    |            ТОГДА ЛОЖЬ
    |        ИНАЧЕ ИСТИНА
    |    КОНЕЦ КАК ЭтоТовар,
    |    ВТ_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
    |ИЗ
    |    ВТ_Товары КАК ВТ_Товары
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
    |                &МоментВремени,
    |                (Номенклатура, Склад) В
    |                    (ВЫБРАТЬ
    |                        ВТ_Товары.Номенклатура,
    |                        ВТ_Товары.Склад
    |                    ИЗ
    |                        ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
    |        ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
    |            И ВТ_Товары.Склад = ТоварыНаСкладахОстатки.Склад
    |
    |УПОРЯДОЧИТЬ ПО
    |    СрокГодности
    |ИТОГИ
    |    МАКСИМУМ(КоличествоВДокументе),
    |    МАКСИМУМ(СуммаВДокументе),
    |    СУММА(КоличествоОстаток),
    |    СУММА(СуммаОстаток)
    |ПО
    |    СтатьяЗатрат,
    |    Номенклатура";
    
    Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("Склад", Склад);
    РезультатЗапроса = Запрос.Выполнить();
    
    // Обход результата с иерархией по СтатьяЗатрат -> Номенклатура -> детальные записи (партии).
    ВыборкаСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
        СуммаЗатрат = 0;  // Общая себестоимость списания для данной статьи затрат.
        ВыборкаНоменклатура = ВыборкаСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
        Пока ВыборкаНоменклатура.Следующий() Цикл
            
            Если ВыборкаНоменклатура.ЭтоТовар Тогда
                // Проверка достаточности общего остатка на складе.
                Если ВыборкаНоменклатура.КоличествоВДокументе > ВыборкаНоменклатура.КоличествоОстаток Тогда
                    Сообщение = Новый СообщениеПользователю;
                    Сообщение.Текст = СтрШаблон("Проведение запрещено. Отсутствуют остатки по номенклатуре ""%1"" в количестве ""%2""",
                        ВыборкаНоменклатура.НоменклатураПредставление,
                        ВыборкаНоменклатура.КоличествоВДокументе - ВыборкаНоменклатура.КоличествоОстаток);
                    Сообщение.Сообщить();
                    Отказ = Истина;
                    Продолжить;
                КонецЕсли;
                
                // Списание по партиям (FEFO: сначала с истекающим сроком годности).
                ОсталосьСписать = ВыборкаНоменклатура.КоличествоВДокументе;
                ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
                Пока ВыборкаДетальныеЗаписи.Следующий() И ОсталосьСписать > 0 Цикл
                    Если ВыборкаДетальныеЗаписи.КоличествоОстаток <= 0 Тогда
                        Продолжить;
                    КонецЕсли;
                    
                    Списываем = Мин(ВыборкаДетальныеЗаписи.КоличествоОстаток, ОсталосьСписать);
                    
                    Движение                 = Движения.ТоварыНаСкладах.ДобавитьРасход();
                    Движение.Период          = Дата;
                    Движение.Номенклатура    = ВыборкаДетальныеЗаписи.Номенклатура;
                    Движение.Склад           = Склад;
                    Движение.СрокГодности    = ВыборкаДетальныеЗаписи.СрокГодности;
                    Движение.Количество      = Списываем;
                    
                    // Расчёт суммы списания пропорционально остатку партии.
                    Если Списываем    = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
                        СуммаСписания = ВыборкаДетальныеЗаписи.СуммаОстаток;
                    Иначе
                        СуммаСписания = Списываем / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СуммаОстаток;
                    КонецЕсли;
                    Движение.Сумма    = СуммаСписания;
                    
                    ОсталосьСписать   = ОсталосьСписать - Списываем;
                    СуммаЗатрат       = СуммаЗатрат + СуммаСписания;
                    
                    // Проводка по списанию себестоимости: Дт 90 "Продажи" Кт счёт учёта номенклатуры.
                    Движение = Движения.Хозрасчетный.Добавить();
                    Движение.СчетДт      = ПланыСчетов.Хозрасчетный.Продажи;
                    Движение.СчетКт      = ВыборкаНоменклатура.СчетБухгалтерскогоУчета;
                    Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура; 
                    Движение.Период      = Дата;    
                    Движение.Сумма       = СуммаСписания;
                    Движение.Содержание  = "Списана себестоимость товарно-материальных ценностей";
                    
                КонецЦикла;
            КонецЕсли;
            
            // Движение по регистру "Продажи" (выручка) – для товаров и услуг.
            ДвижениеПродажи                = Движения.Продажи.Добавить();
            ДвижениеПродажи.Период         = Дата;
            ДвижениеПродажи.Номенклатура   = ВыборкаНоменклатура.Номенклатура;
            ДвижениеПродажи.Контрагент     = Контрагент;
            ДвижениеПродажи.Сотрудник      = Сотрудник;
            ДвижениеПродажи.Количество     = ВыборкаНоменклатура.КоличествоВДокументе;
            ДвижениеПродажи.Сумма          = ВыборкаНоменклатура.СуммаВДокументе;
        КонецЦикла;
        
        // Движение по регистру "Учет затрат" – итоговая себестоимость по статье затрат.
        Если СуммаЗатрат > 0 Тогда
            ДвижениеЗатрат                = Движения.УчетЗатрат.Добавить();
            ДвижениеЗатрат.Период         = Дата;
            ДвижениеЗатрат.СтатьяЗатрат   = ВыборкаСтатьяЗатрат.СтатьяЗатрат;
            ДвижениеЗатрат.Сумма          = СуммаЗатрат;
        КонецЕсли;
    КонецЦикла;
    
    // 5. Движения по регистру "ЗаказыКлиентов" (расход суммы заказа),
    //    если документ создан на основании заказ-наряда.
    Если ЗначениеЗаполнено(ДокументОснование) Тогда
        ДвижениеЗаказа                = Движения.ЗаказыКлиентов.Добавить();
        ДвижениеЗаказа.ВидДвижения    = ВидДвиженияНакопления.Расход;
        ДвижениеЗаказа.Период         = Дата;
        ДвижениеЗаказа.Клиент         = Контрагент;
        ДвижениеЗаказа.ЗаказКлиента   = ДокументОснование;
        ДвижениеЗаказа.Сумма          = Услуги.Итог("Сумма");
    КонецЕсли;
    
    // 6. Движения по регистру "МатериалыЗаказчиков" (расход материалов клиента).
    Для каждого СтрокаМЗ Из МатериалыЗаказчика Цикл
        ДвижениеМЗ                = Движения.МатериалыЗаказчиков.ДобавитьРасход();
        ДвижениеМЗ.Период         = Дата;
        ДвижениеМЗ.Номенклатура   = СтрокаМЗ.Номенклатура;
        ДвижениеМЗ.Заказчик       = Контрагент;
        ДвижениеМЗ.Склад          = Склад;
        ДвижениеМЗ.Количество     = СтрокаМЗ.Количество;
    КонецЦикла;  
    
    // 7. Проводка по отражению выручки: Дт 62 "Расчеты с покупателями" Кт 90 "Продажи".
    Движение            = Движения.Хозрасчетный.Добавить();
    Движение.СчетДт     = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
    Движение.СчетКт     = ПланыСчетов.Хозрасчетный.Продажи;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
    Движение.Период     = Дата;
    Движение.Сумма      = СуммаДокумента;
    Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
    
КонецПроцедуры

#КонецОбласти
